tutorials/electromagnetics/mhdFoam/hartmann/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       7860;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7900;
    }
    lowerWall
    {
        type            patch;
        nFaces          100;
        startFace       7940;
    }
    upperWall
    {
        type            patch;
        nFaces          100;
        startFace       8040;
    }
    frontAndBack
    {
        type            empty;
        nFaces          8000;
        startFace       8140;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
